# EXERCISE

In [1]:
import pandas as pd #import the pandas and aliasing as pd
import numpy as np
data = np.array(["a","b","c","d"])
s1 = pd.Series(data)
print(s1)
data = np.array([1,2,3,4])
s2 = pd.Series(data)
print(s2)

0    a
1    b
2    c
3    d
dtype: object
0    1
1    2
2    3
3    4
dtype: int32

The difference is data in s1 is object but data in s2 is integer.

In [2]:
data = np.array(["a","b","c","d"])
s = pd.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

it is changed by index=[100,101,102,103]

# EXERCISE

In [3]:
s = pd.Series([1,2,3,4,5],index = ["a","b","c","d","e"])
print(s[:3])

1 2 3
a    1
b    2
c    3
dtype: int64

# EXERCISE

In [4]:
s = pd.Series([1,2,3,4,5],index = ["a","b","c","d","e"])
print(s[["a"]])

a    1
dtype: int64

# EXERCISE

In [5]:
data = [[90,70,50,55],[10,20,41,66],[34,25,67,23],[23,32,34,76],[43,73,23,67]]
studentDF = pd.DataFrame(data,columns=["Math","C_programming","Java","Web_programming"])
print(studentDF)

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67

# EXERCISE

In [6]:
data = [[59,37,84,82],[41,34,73,55]]
df3 = pd.DataFrame(data,columns=["Math","C_programming","Java","Web_programming"])
studentDF = studentDF.append(df3, ignore_index = True)
print(studentDF[5:7])

   Math  C_programming  Java  Web_programming
5    59             37    84               82
6    41             34    73               55

# EXERCISE

In [7]:
studentDF = studentDF.drop(6)
print(studentDF)

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82

# EXERCISE

In [8]:
studentDF.sum()

Math               259
C_programming      257
Java               299
Web_programming    369
dtype: int64

# EXERCISE

In [9]:
studentDF.sum(axis=0)

Math               259
C_programming      257
Java               299
Web_programming    369
dtype: int64

In [10]:
studentDF.sum(axis=1)

0    265
1    137
2    149
3    165
4    206
5    262
dtype: int64

# EXERCISE

In [11]:
studentDF.count()

Math               6
C_programming      6
Java               6
Web_programming    6
dtype: int64

In [12]:
studentDF.sum()

Math               259
C_programming      257
Java               299
Web_programming    369
dtype: int64

In [13]:
studentDF.mean()

Math               43.166667
C_programming      42.833333
Java               49.833333
Web_programming    61.500000
dtype: float64

In [14]:
studentDF.median()

Math               38.5
C_programming      34.5
Java               45.5
Web_programming    66.5
dtype: float64

In [15]:
studentDF.mode()

   Math  C_programming  Java  Web_programming
0    10             20    23               23
1    23             25    34               55
2    34             32    41               66
3    43             37    50               67
4    59             70    67               76
5    90             73    84               82

In [16]:
studentDF.std()

Math               28.407159
C_programming      22.973173
Java               22.409076
Web_programming    21.002381
dtype: float64

In [17]:
studentDF.min()

Math               10
C_programming      20
Java               23
Web_programming    23
dtype: int64

In [18]:
studentDF.max()

Math               90
C_programming      73
Java               84
Web_programming    82
dtype: int64

In [19]:
studentDF.abs()

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82

In [20]:
studentDF.prod()

Math                1785540600
C_programming       3025120000
Java                9022246800
Web_programming    34860748560
dtype: int64

In [21]:
studentDF.cumsum()

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1   100             90    91              121
2   134            115   158              144
3   157            147   192              220
4   200            220   215              287
5   259            257   299              369

In [22]:
studentDF.cumprod()

         Math  C_programming        Java  Web_programming
0          90             70          50               55
1         900           1400        2050             3630
2       30600          35000      137350            83490
3      703800        1120000     4669900          6345240
4    30263400       81760000   107407700        425131080
5  1785540600     3025120000  9022246800      34860748560

# EXERCISE

In [23]:
studentDF.describe()

            Math  C_programming       Java  Web_programming
count   6.000000       6.000000   6.000000         6.000000
mean   43.166667      42.833333  49.833333        61.500000
std    28.407159      22.973173  22.409076        21.002381
min    10.000000      20.000000  23.000000        23.000000
25%    25.750000      26.750000  35.750000        57.750000
50%    38.500000      34.500000  45.500000        66.500000
75%    55.000000      61.750000  62.750000        73.750000
max    90.000000      73.000000  84.000000        82.000000

Mean of math score : 42.857143
The third quartile of Java : 70
std of Web programming : 19.329228

In [24]:
studentDF = studentDF.reindex([0,1,2,3,4,5,6,7])
print(studentDF)

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   NaN            NaN   NaN              NaN
7   NaN            NaN   NaN              NaN

In [25]:
df = pd.DataFrame(np.random.randn(5, 3), index=["a", "c", "e",
"f", "h"],columns=["one", "two", "three"])
df = df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
print(df["one"].isnull())
print(df["two"].notnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: two, dtype: bool

In [26]:
studentDF.isnull()

    Math  C_programming   Java  Web_programming
0  False          False  False            False
1  False          False  False            False
2  False          False  False            False
3  False          False  False            False
4  False          False  False            False
5  False          False  False            False
6   True           True   True             True
7   True           True   True             True

In [27]:
studentDF.notnull()

    Math  C_programming   Java  Web_programming
0   True           True   True             True
1   True           True   True             True
2   True           True   True             True
3   True           True   True             True
4   True           True   True             True
5   True           True   True             True
6  False          False  False            False
7  False          False  False            False

In [28]:
s1 = studentDF
s2 = studentDF
s1 = s1.fillna(0)
s2 = s2.fillna(method="pad")
print(s1)
print(s2)

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   0.0            0.0   0.0              0.0
7   0.0            0.0   0.0              0.0
   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6  59.0           37.0  84.0             82.0
7  59.0           37.0  84.0             82.0

s1 index 6 and 7 is 0 all but s2 index 6 and 7 have data look like index 5

In [29]:
left = pd.DataFrame({
'id':[0,1,2,3,4,5],
'section': ['One', 'One', 'One', 'Two', 'Two','Two']})
right = pd.DataFrame(
{'id':[0,1,2,3,4,5],
'name':['Mat','Mike','John','Preecha','Prabu','Bubchu'],
'math':[34,12,34,12,65,23],
'english':[23,13,51,62,12,42]})
print(left)
print(right)
score = pd.merge(left,right,on='id')

   id section
0   0     One
1   1     One
2   2     One
3   3     Two
4   4     Two
5   5     Two
   id     name  math  english
0   0      Mat    34       23
1   1     Mike    12       13
2   2     John    34       51
3   3  Preecha    12       62
4   4    Prabu    65       12
5   5   Bubchu    23       42

In [30]:
merged_table = pd.merge(left,right,on='id')
print(merged_table)

   id section     name  math  english
0   0     One      Mat    34       23
1   1     One     Mike    12       13
2   2     One     John    34       51
3   3     Two  Preecha    12       62
4   4     Two    Prabu    65       12
5   5     Two   Bubchu    23       42

In [31]:
score_sec = score.groupby('section')
score_sec.sum()

         id  math  english
section
One       3    80       87
Two      12   100      116